Alexislilei/matter-thermostat/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_MBEDTLS_HKDF_C=y

# 自定义分区表 (8MB Flash, factory 3MB)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

# BLE 配网支持 (Matter BLE Commissioning)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=5120
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=3
CONFIG_BT_CTRL_MODE_EFF=1

# 解决 IRAM 溢出：将 WiFi 和 NimBLE IRAM 优化代码移到 Flash
# 避免 iram0_0_seg overflow (BLE 占用了额外 IRAM)
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n
CONFIG_BT_NIMBLE_HOST_IRAM_OPT=n

# LVGL 字体配置 (LCD UI 使用)
# 顶部信息栏用 20 (原14的1.5倍)；TEMP 标签用 16；HEAT/TIMER 底部状态栏用 24 (原16的1.5倍)；
# 设定温度用 40 (原20的2倍)；主页面大字/STANDBY 用 48 (原32的2倍)
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
